In [70]:
# Imports
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

### Transforming and Normalizing

#### Basics table

In [71]:
# transforming and normalizing tables
title_basics = pd.read_csv('Data/basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,74,"Horror,Music,Thriller"

##### Creating title_genres and genres tables

In [72]:
# creating lists of the genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [73]:
# exploding the genres to separate all unique values
exploded_genres = title_basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,Drama

In [74]:
# sorting the list alphabetically
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [75]:
# creating title_genres table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [76]:
# creating a mapping dictionary for the genres and new id numbers
genre_nums = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_nums))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [77]:
# creating genre_id column
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
# dropping redundant column
title_genres = title_genres.drop(columns = 'genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [78]:
# creating the genre table
genres = pd.DataFrame({'genre_id': genre_map.values(),
                    'genre_name': genre_map.keys()})
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

#### Cleaning up the title basics dataframe

In [79]:
# drop unwated columns
title_basics = title_basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'])
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81759 entries, 0 to 81758
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81759 non-null  object
 1   primaryTitle    81759 non-null  object
 2   startYear       81759 non-null  int64
 3   runtimeMinutes  81759 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.5+ MB

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0093119,Grizzly II: Revenge,2020,74

#### Importing two additional tables

In [80]:
# importing the ratings table
title_ratings = pd.read_csv('Data/ratings.csv.gz')
title_ratings.info()
title_ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1246490 entries, 0 to 1246489
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1246490 non-null  object
 1   averageRating  1246490 non-null  float64
 2   numVotes       1246490 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.5+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1900
1  tt0000002            5.9       254
2  tt0000003            6.5      1692
3  tt0000004            5.7       166
4  tt0000005            6.2      2509

In [81]:
# importing tmbd data
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.info()
tmdb_data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   imdb_id  178 non-null    object
 1   title    178 non-null    object
 2   revenue  178 non-null    float64
 3   budget   178 non-null    float64
 4   rating   178 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.1+ KB

     imdb_id                     title      revenue       budget rating
0  tt0118694      In the Mood for Love   12854953.0     150000.0     PG
1  tt0119273          Heavy Metal 2000          0.0   15000000.0      R
2  tt0120753  The Million Dollar Hotel     105983.0    8000000.0      R
3  tt0120913                Titan A.E.   36754634.0   75000000.0     PG
4  tt0120917  The Emperor's New Groove  169327687.0  100000000.0      G

### Creating Database

In [82]:
# creating a connection string
connection_str = "mysql+pymysql://root:root@localhost/movies"
# connecting mySQL and Python via JNB
engine = create_engine(connection_str)
# creating the database
#        create_database(connection_str)
# checking if the database exists
#        database_exists(connection_str)
# when running this code again the create_database line above will have an error. This will prevent that.
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

#### Creating a schema for each table

In [83]:
# tmbd table
# getting max length for string columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
title_len = tmdb_data['title'].fillna('').map(len).max()
rating_len = tmdb_data['rating'].fillna('').map(len).max()
# creating the schema
tmdb_schema = {
    "imdb_id": String(key_len+1),
    "title": Text(title_len+1),
    "revenue": Float(),
    "budget": Float(),
    "rating": Text(rating_len+1)}

In [84]:
# title ratings
# getting max length for string columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

# creating the schema
ratings_schema = {
    "tconst": String(key_len+1),
    "averageRating": Float(),
    "numVotes": Integer()}

In [85]:
# title basics table
# getting max length for string columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

# creating the schema
title_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear": Integer(),
    "runtimeMinutes": Integer()}

### Creating tables in the database

In [86]:
# tmbd table
tmdb_data.to_sql('tmdb_data', engine, dtype = tmdb_schema, 
                 if_exists = 'replace', index = False)
# getting tconst as the primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [87]:
# ratings table
title_ratings.to_sql('title_ratings', engine, dtype = ratings_schema, 
                 if_exists = 'replace', index = False)
# getting tconst as the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [88]:
# title table
title_basics.to_sql('title_basics', engine, dtype = title_schema, 
                 if_exists = 'replace', index = False)
# getting tconst as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [95]:
# genre table
genres.set_index('genre_id').to_sql('genres', engine, if_exists = 'replace', index=True)

26

In [90]:
# title_genres table
title_genres.to_sql('title_genres', engine, if_exists = 'replace', index = False)

152654

### Exploring tables in MySQL

In [91]:
# 1 title_basics
q = """
SELECT * 
FROM title_basics
LIMIT 5;
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0093119,Grizzly II: Revenge,2020,74

In [92]:
# 2 title_ratings
q = """
SELECT * 
FROM title_ratings
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1900
1  tt0000002            5.9       254
2  tt0000003            6.5      1692
3  tt0000004            5.7       166
4  tt0000005            6.2      2509

In [93]:
# 3 title_genres
q = """
SELECT * 
FROM title_genres
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [96]:
# 4 genres
q = """
SELECT * 
FROM genres
LIMIT 5;
"""
pd.read_sql(q, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [97]:
# 5 tmdb_data
q = """
SELECT * 
FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q, engine)

     imdb_id                  title     revenue      budget rating
0  tt0035423         Kate & Leopold  76019000.0  48000000.0  PG-13
1  tt0118652  The Attic Expeditions         0.0   1000000.0      R
2  tt0118694   In the Mood for Love  12855000.0    150000.0     PG
3  tt0119273       Heavy Metal 2000         0.0  15000000.0      R
4  tt0120681              From Hell  74558100.0  35000000.0      R

#### Showing all tables

In [99]:
# all tables in the database
q = """
SHOW TABLES;
"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data